Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase
The Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase class provides the base class for manipulating the components.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase.connection
The feature connection.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase.manipulatorManager
The manipulator manager.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase.description
The object type description.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase.manipulationContextDictionary
The manipulation context dictionary.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase.#ctor(System.Int32,System.String,System.Boolean)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase class.
id: The identifier of the component.
name: The name of the component.
useFeatureContextualToolBar:
The System.Boolean value to indicate whether the feature level contextual toolbar should be used.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase.Components
Gets the underlying components for the feature.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase.Initialize
Initializes the feature.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase.Refresh
Refreshes the feature.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase.AttachManipulationContexts(Tekla.Structures.Model.Component)
Attaches the manipulation contexts to the component.
Remarks:
This method must be overridden to attach any custom manipulation ability to the component.
component: The component context.
Returns: A collection of manipulation contexts that should be attached to the component.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase.GetActivationDefinitions


Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase.OnActivated(Tekla.BIM.DirectManipulation.Features.FeatureActivationEventArgs)


Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase.OnRefreshSuggested(Tekla.BIM.DirectManipulation.Features.FeatureActivationEventArgs)


Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase.RefreshManipulationContexts(Tekla.Structures.Model.Component,System.Collections.Generic.IEnumerable{Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext})
Clears and disposes the existing manipulation contexts and adds new manipulation contexts for the component.
component: The component.
contexts: The new manipluation contexts.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase.AttachManipulator(Tekla.Structures.Plugins.DirectManipulation.Core.ManipulatorBase)
Attaches a manipulator to the feature.
manipulator: The manipulator to be attached.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase.InitializeManipulationContexts(System.Collections.Generic.IEnumerable{Tekla.Structures.Model.Component})
Initializes the manipulation contexts.
components: The components.